<?php

defined('SYSPATH') or die('No direct script access.');

return array(	
			"表示未处理",
			"处理成功",
			"错误！上传列表为空。",
			"错误！文件不存在。",
			"错误！子上传列表与子保存列表不一致。",
			"错误！上传时键名为空。",
			"错误！上传时保存路径为空。",
			"错误！上传失败1。",
			"错误！上传失败2。",
			"错误！上传失败3。",
			"上传的文件超过了 php.ini 中 upload_max_filesize 选项限制的值。",
			"上传文件的大小超过了 HTML 表单中 MAX_FILE_SIZE 选项指定的值。",
			"文件只有部分被上传。",
			"没有文件被上传。",
			"找不到临时文件夹。",
			"文件写入失败。",
			"错误！未知的上传错误。",
			"错误！没有进行上传。",
			"错误！上传的大小超过了策略中的限制。",
			"错误！存在同名文件。",
			"错误！目录不可写。",
			"错误！上传文件不允许覆盖，出现同名文件。",
			"错误！移动文件到目标路径下产生错误。",
			"错误！临时文件没有被上传到服务器上。",
			"错误！根据客户端传递的扩展名不被允许。",
			"错误！根据客户端传递的扩展名不在已知的MIME列表中。",
			"错误！文件MIME-TYPE不被服务器所支持。"
			);